# Данная программа высчитывает количество слов, символов, прописных и строчных
# букв в строке, которую предлагается ввести пользователю.

print('Введите текст:')
s = input()                                               # Входные данные.

from collections import Counter                           # Функция для подсчета слов.
words = Counter(s.lower().split())                        # Разделение строки на части, а также преобразование
                                                          # строки к нижнему регистру.
print('Количество слов в строке:', len(words))

letters_s = 0
letters_b = 0
for i in s:                                               # Цикл для подсчета строчных и прописных букв.
    if 'а' <= i <= 'я':
        letters_s += 1
    else:
        if 'А' <= i <= 'Я':
            letters_b += 1
summ = letters_s + letters_b
print('Количество символов:', len(s))
print('Количество букв:', summ)
print('Среди них строчных:', letters_s)
print('Среди них прописных:', letters_b)

